Repository: yantaolu/easy-context
Catalog: EasyContext/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, zh_hans, zh_hant

source: Add
de: Hinzufügen
es: Añadir
fr: Ajouter
ja: 追加
zh_hans: 添加
zh_hant: 新增

source: Add Anyway
de: Trotzdem hinzufügen
es: Añadir de todos modos
fr: Ajouter quand même
ja: 追加する
zh_hans: 仍然添加
zh_hant: 仍要新增

source: Add command
de: Befehl hinzufügen
es: Añadir comando
fr: Ajouter une commande
ja: コマンドを追加
zh_hans: 新增命令
zh_hant: 新增指令

source: Add custom app
de: Eigene App hinzufügen
es: Añadir app personalizada
fr: Ajouter une app personnalisée
ja: カスタム App を追加
zh_hans: 添加自定义 App
zh_hant: 新增自訂 App

source: App Icon
de: App-Symbol
es: Icono de la app
fr: Icône de l'app
ja: アプリアイコン
zh_hans: 应用图标
zh_hant: 應用程式圖示

source: Automation Permission Required
de: Automatisierungsberechtigung erforderlich
es: Se requiere permiso de automatización
fr: Autorisation d'automatisation requise
ja: オートメーションの許可が必要です
zh_hans: 需要自动化权限
zh_hant: 需要自動化權限

source: Built-in template
de: Integrierte Vorlage
es: Plantilla integrada
fr: Modèle intégré
ja: 内蔵テンプレート
zh_hans: 内置模板
zh_hant: 內建範本

source: Can't Add “%@”
de: „%@“ kann nicht hinzugefügt werden
es: No se puede añadir “%@”
fr: Impossible d'ajouter « %@ »
ja: “%@”を追加できません
zh_hans: 无法添加“%@”
zh_hant: 無法新增「%@」

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

source: Cannot Run
de: Ausführung nicht möglich
es: No se puede ejecutar
fr: Impossible d'exécuter
ja: 実行できません
zh_hans: 无法运行
zh_hant: 無法執行

source: Cannot Verify Request
de: Anfrage kann nicht verifiziert werden
es: No se puede verificar la solicitud
fr: Impossible de vérifier la requête
ja: リクエストを検証できません
zh_hans: 无法验证请求
zh_hant: 無法驗證請求

source: Close Window
de: Fenster schließen
es: Cerrar ventana
fr: Fermer la fenêtre
ja: ウインドウを閉じる
zh_hans: 关闭窗口
zh_hant: 關閉視窗

source: Color
de: Farbig
fr: Couleur
ja: カラー
zh_hans: 彩色
zh_hant: 彩色

source: Command
de: Befehl
es: Comando
fr: Commande
ja: コマンド
zh_hans: 命令
zh_hant: 指令

source: Command, e.g. claude
de: Befehl, z. B. claude
es: Comando, p. ej. claude
fr: Commande, p. ex. claude
ja: コマンド（例：claude）
zh_hans: 命令，如 claude
zh_hant: 指令，例如 claude

source: Config file is corrupted. It was backed up as config.json.bak; using default settings.
de: Konfigurationsdatei ist beschädigt. Sie wurde als config.json.bak gesichert; Standardeinstellungen werden verwendet.
es: El archivo de configuración está dañado. Se guardó como config.json.bak; se usan los ajustes predeterminados.
fr: Le fichier de configuration est corrompu. Il a été sauvegardé sous config.json.bak ; réglages par défaut utilisés.
ja: 設定ファイルが破損しています。config.json.bak としてバックアップし、デフォルト設定を使用中です。
zh_hans: 配置文件损坏，已备份为 config.json.bak，当前使用默认设置
zh_hant: 設定檔已損毀，已備份為 config.json.bak，目前使用預設設定

source: Copy
de: Kopieren
es: Copiar
fr: Copier
ja: コピー
zh_hans: 拷贝
zh_hant: 拷貝

source: Copy Path
de: Pfad kopieren
es: Copiar ruta
fr: Copier le chemin
ja: パスをコピー
zh_hans: 复制路径
zh_hant: 複製路徑

source: Copy Relative Path
de: Relativen Pfad kopieren
es: Copiar ruta relativa
fr: Copier le chemin relatif
ja: 相対パスをコピー
zh_hans: 复制相对路径
zh_hant: 複製相對路徑

source: Could not create a file in this folder.
de: In diesem Ordner konnte keine Datei erstellt werden.
es: No se pudo crear un archivo en esta carpeta.
fr: Impossible de créer un fichier dans ce dossier.
ja: このフォルダにファイルを作成できませんでした。
zh_hans: 无法在该目录创建文件。
zh_hant: 無法在該目錄建立檔案。

source: Create
de: Erstellen
es: Crear
fr: Créer
ja: 作成
zh_hans: 创建
zh_hant: 建立

source: Custom
de: Eigen
es: Personalizado
fr: Personnalisé
ja: カスタム
zh_hans: 自定义
zh_hant: 自訂

source: Custom Commands
de: Eigene Befehle
es: Comandos personalizados
fr: Commandes personnalisées
ja: カスタムコマンド
zh_hans: 自定义命令
zh_hant: 自訂指令

source: Custom override
de: Eigene Überschreibung
es: Sustitución personalizada
fr: Remplacement personnalisé
ja: カスタム上書き
zh_hans: 自定义覆盖
zh_hant: 自訂覆寫

source: Cut
de: Ausschneiden
es: Cortar
fr: Couper
ja: カット
zh_hans: 剪切
zh_hant: 剪下

source: Delete selected command
de: Ausgewählten Befehl löschen
es: Eliminar el comando seleccionado
fr: Supprimer la commande sélectionnée
ja: 選択したコマンドを削除
zh_hans: 删除选中的命令
zh_hant: 刪除所選指令

source: Done
de: Fertig
es: Listo
fr: Terminé
ja: 完了
zh_hans: 完成
zh_hant: 完成

source: Edit
de: Bearbeiten
es: Edición
fr: Édition
ja: 編集
zh_hans: 编辑
zh_hant: 編輯

source: Editors shown in menu
de: Im Menü angezeigte Editoren
es: Editores mostrados en el menú
fr: Éditeurs affichés dans le menu
ja: メニューに表示するエディタ
zh_hans: 菜单显示的编辑器
zh_hant: 選單顯示的編輯器

source: Enable
de: Aktivieren
es: Activar
fr: Activer
ja: 有効にする
zh_hans: 去启用
zh_hant: 前往啟用

source: Enter file name:
de: Dateiname eingeben:
es: Introduce el nombre del archivo:
fr: Saisir le nom du fichier :
ja: ファイル名を入力：
zh_hans: 输入文件名：
zh_hant: 輸入檔案名稱：

source: Failed to Create File
de: Datei konnte nicht erstellt werden
es: Error al crear el archivo
fr: Échec de la création du fichier
ja: ファイルの作成に失敗しました
zh_hans: 新建文件失败
zh_hant: 新增檔案失敗

source: File
de: Ablage
es: Archivo
fr: Fichier
ja: ファイル
zh_hans: 文件
zh_hant: 檔案

source: Finder Extension Settings
de: Finder-Erweiterungseinstellungen
es: Ajustes de la extensión del Finder
fr: Réglages de l'extension Finder
ja: Finder 機能拡張の設定
zh_hans: 访达扩展设置
zh_hant: Finder 擴充功能設定

source: Hide Easy Context
de: Easy Context ausblenden
es: Ocultar Easy Context
fr: Masquer Easy Context
ja: Easy Context を隠す
zh_hans: 隐藏 Easy Context
zh_hant: 隱藏 Easy Context

source: Menu Items
de: Menüeinträge
es: Elementos del menú
fr: Éléments du menu
ja: メニュー項目
zh_hans: 菜单项
zh_hant: 選單項目

source: Monochrome
de: Schwarzweiß
es: Monocromo
ja: モノクロ
zh_hans: 黑白
zh_hant: 黑白

source: New File
de: Neue Datei
es: Nuevo archivo
fr: Nouveau fichier
ja: 新規ファイル
zh_hans: 新建文件
zh_hant: 新增檔案

source: No template
de: Keine Vorlage
es: Sin plantilla
fr: Aucun modèle
ja: テンプレートなし
zh_hans: 无模板
zh_hant: 無範本

source: Open Config Folder
de: Konfigurationsordner öffnen
es: Abrir carpeta de configuración
fr: Ouvrir le dossier de configuration
ja: 設定フォルダを開く
zh_hans: 打开配置目录
zh_hant: 開啟設定資料夾

source: Open System Settings
de: Systemeinstellungen öffnen
es: Abrir Ajustes del Sistema
fr: Ouvrir Réglages Système
ja: システム設定を開く
zh_hans: 打开系统设置
zh_hant: 打開系統設定

source: Other
de: Sonstiges
es: Otros
fr: Autre
ja: その他
zh_hans: 其他
zh_hant: 其他

source: Paste
de: Einsetzen
es: Pegar
fr: Coller
ja: ペースト
zh_hans: 粘贴
zh_hant: 貼上

source: Placeholders: {dir} = target directory, {cmd} = command; replaced with "$EC_DIR"/"$EC_CMD" at run time — don't add quotes. $EC_SHELL = the user's login shell.
de: Platzhalter: {dir} = Zielverzeichnis, {cmd} = Befehl; zur Laufzeit durch "$EC_DIR"/"$EC_CMD" ersetzt — keine eigenen Anführungszeichen hinzufügen. $EC_SHELL = Login-Shell des Benutzers.
es: Marcadores: {dir} = directorio de destino, {cmd} = comando; se sustituyen en tiempo de ejecución por "$EC_DIR"/"$EC_CMD" — no añadas comillas. $EC_SHELL = shell de inicio de sesión del usuario.
fr: Espaces réservés : {dir} = répertoire cible, {cmd} = commande ; remplacés à l'exécution par "$EC_DIR"/"$EC_CMD" — n'ajoutez pas de guillemets. $EC_SHELL = shell de connexion de l'utilisateur.
ja: プレースホルダ：{dir}=対象ディレクトリ、{cmd}=コマンド。実行時に "$EC_DIR"/"$EC_CMD" に置換されるため、引用符を自分で付けないでください。$EC_SHELL はログインシェルです。
zh_hans: 占位符：{dir}=目标目录、{cmd}=命令；执行时替换为 "$EC_DIR"/"$EC_CMD"，请勿自行加引号。$EC_SHELL 为用户登录 shell。
zh_hant: 佔位符：{dir}=目標目錄、{cmd}=指令；執行時替換為 "$EC_DIR"/"$EC_CMD"，請勿自行加引號。$EC_SHELL 為使用者登入 shell。

source: Quit Easy Context
de: Easy Context beenden
es: Salir de Easy Context
fr: Quitter Easy Context
ja: Easy Context を終了
zh_hans: 退出 Easy Context
zh_hant: 結束 Easy Context

source: Re-check
de: Erneut prüfen
es: Volver a comprobar
fr: Revérifier
ja: 再検出
zh_hans: 重新检测
zh_hant: 重新偵測

source: Redo
de: Wiederholen
es: Rehacer
fr: Rétablir
ja: やり直す
zh_hans: 重做
zh_hant: 重做

source: Remove selected custom item (built-in items can't be removed)
de: Ausgewählten eigenen Eintrag entfernen (integrierte Einträge lassen sich nicht entfernen)
es: Quitar el elemento personalizado seleccionado (los integrados no se pueden quitar)
fr: Retirer l'élément personnalisé sélectionné (les éléments intégrés ne peuvent pas être retirés)
ja: 選択したカスタム項目を削除（内蔵項目は削除不可）
zh_hans: 移除选中的自定义项（内置项不可删）
zh_hant: 移除所選自訂項目（內建項目無法移除）

source: Restore Default
de: Standard wiederherstellen
es: Restaurar predeterminado
fr: Rétablir par défaut
ja: デフォルトに戻す
zh_hans: 恢复默认
zh_hant: 回復預設

source: Retry
de: Erneut versuchen
es: Reintentar
fr: Réessayer
ja: 再試行
zh_hans: 重试
zh_hant: 重試

source: Run Failed
de: Ausführung fehlgeschlagen
es: Error al ejecutar
fr: Échec de l'exécution
ja: 実行に失敗しました
zh_hans: 运行失败
zh_hant: 執行失敗

source: Run in terminal
de: Ausführungsterminal
es: Terminal de ejecución
fr: Terminal d'exécution
ja: 実行ターミナル
zh_hans: 执行终端
zh_hant: 執行終端機

source: Save
de: Sichern
es: Guardar
fr: Enregistrer
ja: 保存
zh_hans: 保存
zh_hant: 儲存

source: Select All
de: Alles auswählen
es: Seleccionar todo
fr: Tout sélectionner
ja: すべてを選択
zh_hans: 全选
zh_hant: 全選

source: Select a terminal to edit its launch template.
de: Wählen Sie ein Terminal aus, um seine Startvorlage zu bearbeiten.
es: Selecciona un terminal para editar su plantilla de inicio.
fr: Sélectionnez un terminal pour modifier son modèle de lancement.
ja: ターミナルを選択して起動テンプレートを編集します。
zh_hans: 选择一个终端以编辑其启动模板。
zh_hant: 選擇一個終端機以編輯其啟動範本。

source: Settings can't be written to disk. Changes apply to this session only.
de: Einstellungen können nicht auf die Festplatte geschrieben werden. Änderungen gelten nur für diese Sitzung.
es: No se pueden guardar los ajustes en el disco. Los cambios solo se aplican a esta sesión.
fr: Impossible d'enregistrer les réglages sur le disque. Les modifications ne s'appliquent qu'à cette session.
ja: 設定をディスクに書き込めません。変更は今回の起動中のみ有効です。
zh_hans: 设置无法写入磁盘，更改仅本次运行期间生效。
zh_hant: 設定無法寫入磁碟，變更僅在本次執行期間生效。

source: Templates…
de: Vorlagen…
es: Plantillas…
fr: Modèles…
ja: テンプレート…
zh_hans: 模板…
zh_hant: 範本…

source: Terminal Launch Templates
de: Terminal-Startvorlagen
es: Plantillas de inicio del terminal
fr: Modèles de lancement du terminal
ja: ターミナル起動テンプレート
zh_hans: 终端启动模板
zh_hant: 終端機啟動範本

source: Terminals need a launch template to run commands. Terminals without one can't be used as the execution terminal until you add a template here.
de: Terminals benötigen eine Startvorlage, um Befehle auszuführen. Terminals ohne Vorlage können erst als Ausführungsterminal verwendet werden, wenn Sie hier eine hinzufügen.
es: Los terminales necesitan una plantilla de inicio para ejecutar comandos. Los terminales sin plantilla no pueden usarse como terminal de ejecución hasta que añadas una aquí.
fr: Les terminaux ont besoin d'un modèle de lancement pour exécuter des commandes. Les terminaux sans modèle ne peuvent pas servir de terminal d'exécution tant que vous n'en ajoutez pas un ici.
ja: コマンドを実行するにはターミナルに起動テンプレートが必要です。テンプレートのないターミナルは、ここでテンプレートを追加するまで実行ターミナルとして使用できません。
zh_hans: 终端需要启动模板才能运行命令。没有模板的终端无法被选为执行终端，在这里为它添加模板即可启用。
zh_hant: 終端機需要啟動範本才能執行指令。沒有範本的終端機無法被選為執行終端機，在這裡為它新增範本即可啟用。

source: Terminals shown in menu
de: Im Menü angezeigte Terminals
es: Terminales mostrados en el menú
fr: Terminaux affichés dans le menu
ja: メニューに表示するターミナル
zh_hans: 菜单显示的终端
zh_hant: 選單顯示的終端機

source: The Finder extension isn't enabled yet, so the right-click menu won't appear.
de: Die Finder-Erweiterung ist noch nicht aktiviert, daher erscheint das Kontextmenü nicht.
es: La extensión del Finder aún no está activada, por lo que el menú contextual no aparecerá.
fr: L'extension Finder n'est pas encore activée, le menu contextuel n'apparaîtra pas.
ja: Finder 機能拡張がまだ有効になっていないため、右クリックメニューは表示されません。
zh_hans: 访达扩展尚未启用，右键菜单不会出现
zh_hant: Finder 擴充功能尚未啟用，右鍵選單不會出現

source: The app's information could not be read, so it can't be added.
de: Die Informationen der App konnten nicht gelesen werden, daher kann sie nicht hinzugefügt werden.
es: No se pudo leer la información de la app, por lo que no se puede añadir.
fr: Les informations de l'app n'ont pas pu être lues, elle ne peut donc pas être ajoutée.
ja: アプリの情報を読み取れないため、追加できません。
zh_hans: 无法读取该应用的信息，无法添加。
zh_hant: 無法讀取該應用程式的資訊，無法新增。

source: The command exited with an error.
de: Der Befehl wurde mit einem Fehler beendet.
es: El comando terminó con un error.
fr: La commande s'est terminée avec une erreur.
ja: コマンドがエラーで終了しました。
zh_hans: 命令执行出错并退出。
zh_hant: 指令執行出錯並結束。

source: The request could not be verified. Please try again from the right-click menu.
de: Die Anfrage konnte nicht verifiziert werden. Bitte versuchen Sie es erneut über das Kontextmenü.
es: No se pudo verificar la solicitud. Inténtalo de nuevo desde el menú contextual.
fr: La requête n'a pas pu être vérifiée. Veuillez réessayer depuis le menu contextuel.
ja: リクエストを検証できませんでした。右クリックメニューからもう一度お試しください。
zh_hans: 无法验证该请求。请从右键菜单重试。
zh_hant: 無法驗證該請求。請從右鍵選單重試。

source: This app doesn't declare that it can open folders, so clicking it from the right-click menu may not open the directory. Add it anyway?
de: Diese App gibt nicht an, dass sie Ordner öffnen kann. Beim Klick im Kontextmenü wird der Ordner möglicherweise nicht geöffnet. Trotzdem hinzufügen?
es: Esta app no declara que pueda abrir carpetas, así que al hacer clic desde el menú contextual puede que no abra el directorio. ¿Añadirla de todos modos?
fr: Cette app ne déclare pas pouvoir ouvrir des dossiers ; en cliquant depuis le menu contextuel, le dossier pourrait ne pas s'ouvrir. L'ajouter quand même ?
ja: この App はフォルダを開けると宣言していないため、右クリックメニューから選んでもディレクトリを開けないことがあります。追加しますか？
zh_hans: 该应用未声明可打开文件夹，从右键菜单点击它时可能无法正常打开目录。仍要添加吗？
zh_hant: 此應用程式未宣告可開啟資料夾，從右鍵選單點按它時可能無法正常開啟資料夾。仍要新增嗎？

source: This command was removed or disabled. Reopen the right-click menu and try again.
de: Dieser Befehl wurde entfernt oder deaktiviert. Öffnen Sie das Kontextmenü erneut und versuchen Sie es noch einmal.
es: Este comando se ha eliminado o desactivado. Vuelve a abrir el menú contextual e inténtalo de nuevo.
fr: Cette commande a été supprimée ou désactivée. Rouvrez le menu contextuel et réessayez.
ja: このコマンドは削除または無効化されています。右クリックメニューを開き直してもう一度お試しください。
zh_hans: 该命令已被删除或停用。请重新打开右键菜单再试。
zh_hant: 該指令已被刪除或停用。請重新開啟右鍵選單再試。

source: Undo
de: Widerrufen
es: Deshacer
fr: Annuler
ja: 取り消す
zh_hans: 撤销
zh_hant: 還原

source: macOS is blocking Easy Context from controlling the terminal. Enable Easy Context in System Settings → Privacy & Security → Automation, then try again.
de: macOS blockiert die Steuerung des Terminals durch Easy Context. Erlauben Sie Easy Context unter „Systemeinstellungen → Datenschutz & Sicherheit → Automatisierung“ und versuchen Sie es erneut.
es: macOS está impidiendo que Easy Context controle el terminal. Permite Easy Context en Ajustes del Sistema → Privacidad y seguridad → Automatización y vuelve a intentarlo.
fr: macOS empêche Easy Context de contrôler le terminal. Autorisez Easy Context dans Réglages Système → Confidentialité et sécurité → Automatisation, puis réessayez.
ja: macOS が Easy Context によるターミナルの制御をブロックしています。「システム設定 → プライバシーとセキュリティ → オートメーション」で Easy Context を許可してから、もう一度お試しください。
zh_hans: macOS 正在阻止 Easy Context 控制终端。请在「系统设置 → 隐私与安全性 → 自动化」中允许 Easy Context，然后重试。
zh_hant: macOS 正在阻止 Easy Context 控制終端機。請在「系統設定 → 隱私權與安全性 → 自動化」中允許 Easy Context，然後再試一次。

source: “%@” has no launch template configured. Please add one in EasyContext settings.
de: Für „%@“ ist keine Startvorlage konfiguriert. Bitte lege in den EasyContext-Einstellungen eine an.
es: «%@» no tiene una plantilla de inicio configurada. Añádela en los ajustes de EasyContext.
fr: Aucun modèle de lancement n'est configuré pour « %@ ». Ajoutez-en un dans les réglages d'EasyContext.
ja: 「%@」に起動テンプレートが設定されていません。EasyContext の設定でテンプレートを入力してください。
zh_hans: “%@” 未配置启动模板，请在 EasyContext 设置里为它填写模板。
zh_hant: 「%@」尚未設定啟動範本，請在 EasyContext 設定中為它填寫範本。

source: “%@” may not support opening folders
de: „%@“ unterstützt möglicherweise kein Öffnen von Ordnern
es: «%@» podría no admitir la apertura de carpetas
fr: « %@ » ne prend peut-être pas en charge l'ouverture de dossiers
ja: 「%@」はフォルダを開くことに対応していない可能性があります
zh_hans: “%@” 可能不支持以目录方式打开
zh_hant: 「%@」可能不支援以目錄方式開啟

source: Name
es: Nombre
fr: Nom
ja: 名前
zh_hans: 名称
zh_hant: 名稱

source: OK
es: Aceptar
zh_hans: 好
zh_hant: 好
